Revit 2027 API
TextBaselineStyle Enumeration
 Supported styles of text position relative to the normal baseline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TextBaselineStyle
Public Enumeration TextBaselineStyle
public enum class TextBaselineStyle
type TextBaselineStyle
Members
Member name | Value | Description
Normal | 0 |  Indicates a normal text with letters positioned on the baseline.
Subscript | 1 |  Indicates a subsript text.
Superscript | 2 |  Indicates a superscript text.
See Also
Reference
Autodesk.Revit.DB Namespace